Microchip-MPLAB-Harmony/csp/apps/trustZone/eic/Secure/firmware/src/packs/ATSAML11E16A_DFP/component/evsys.h
/* -------- EVSYS_INTENCLR : (EVSYS Offset: 0x1D4) (R/W 8) Interrupt Enable Clear -------- */
#define EVSYS_INTENCLR_RESETVALUE             _U_(0x00)                                            /**<  (EVSYS_INTENCLR) Interrupt Enable Clear  Reset Value */

#define EVSYS_INTENCLR_NSCHK_Pos              _U_(0)                                               /**< (EVSYS_INTENCLR) Non-Secure Check Interrupt Enable Position */
#define EVSYS_INTENCLR_NSCHK_Msk              (_U_(0x1) << EVSYS_INTENCLR_NSCHK_Pos)               /**< (EVSYS_INTENCLR) Non-Secure Check Interrupt Enable Mask */
#define EVSYS_INTENCLR_NSCHK(value)           (EVSYS_INTENCLR_NSCHK_Msk & ((value) << EVSYS_INTENCLR_NSCHK_Pos))
#define EVSYS_INTENCLR_Msk                    _U_(0x01)                                            /**< (EVSYS_INTENCLR) Register Mask  */


/* -------- EVSYS_INTENSET : (EVSYS Offset: 0x1D5) (R/W 8) Interrupt Enable Set -------- */
#define EVSYS_INTENSET_RESETVALUE             _U_(0x00)                                            /**<  (EVSYS_INTENSET) Interrupt Enable Set  Reset Value */

#define EVSYS_INTENSET_NSCHK_Pos              _U_(0)                                               /**< (EVSYS_INTENSET) Non-Secure Check Interrupt Enable Position */
#define EVSYS_INTENSET_NSCHK_Msk              (_U_(0x1) << EVSYS_INTENSET_NSCHK_Pos)               /**< (EVSYS_INTENSET) Non-Secure Check Interrupt Enable Mask */
#define EVSYS_INTENSET_NSCHK(value)           (EVSYS_INTENSET_NSCHK_Msk & ((value) << EVSYS_INTENSET_NSCHK_Pos))
#define EVSYS_INTENSET_Msk                    _U_(0x01)                                            /**< (EVSYS_INTENSET) Register Mask  */


/* -------- EVSYS_INTFLAG : (EVSYS Offset: 0x1D6) (R/W 8) Interrupt Flag Status and Clear -------- */
#define EVSYS_INTFLAG_RESETVALUE              _U_(0x00)                                            /**<  (EVSYS_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define EVSYS_INTFLAG_NSCHK_Pos               _U_(0)                                               /**< (EVSYS_INTFLAG) Non-Secure Check Position */
#define EVSYS_INTFLAG_NSCHK_Msk               (_U_(0x1) << EVSYS_INTFLAG_NSCHK_Pos)                /**< (EVSYS_INTFLAG) Non-Secure Check Mask */
#define EVSYS_INTFLAG_NSCHK(value)            (EVSYS_INTFLAG_NSCHK_Msk & ((value) << EVSYS_INTFLAG_NSCHK_Pos))
#define EVSYS_INTFLAG_Msk                     _U_(0x01)                                            /**< (EVSYS_INTFLAG) Register Mask  */


/* -------- EVSYS_NONSECCHAN : (EVSYS Offset: 0x1D8) (R/W 32) Channels Security Attribution -------- */
#define EVSYS_NONSECCHAN_RESETVALUE           _U_(0x00)                                            /**<  (EVSYS_NONSECCHAN) Channels Security Attribution  Reset Value */

#define EVSYS_NONSECCHAN_CHANNEL0_Pos         _U_(0)                                               /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 0 Position */
#define EVSYS_NONSECCHAN_CHANNEL0_Msk         (_U_(0x1) << EVSYS_NONSECCHAN_CHANNEL0_Pos)          /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 0 Mask */
#define EVSYS_NONSECCHAN_CHANNEL0(value)      (EVSYS_NONSECCHAN_CHANNEL0_Msk & ((value) << EVSYS_NONSECCHAN_CHANNEL0_Pos))
#define EVSYS_NONSECCHAN_CHANNEL1_Pos         _U_(1)                                               /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 1 Position */
#define EVSYS_NONSECCHAN_CHANNEL1_Msk         (_U_(0x1) << EVSYS_NONSECCHAN_CHANNEL1_Pos)          /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 1 Mask */
#define EVSYS_NONSECCHAN_CHANNEL1(value)      (EVSYS_NONSECCHAN_CHANNEL1_Msk & ((value) << EVSYS_NONSECCHAN_CHANNEL1_Pos))
#define EVSYS_NONSECCHAN_CHANNEL2_Pos         _U_(2)                                               /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 2 Position */
#define EVSYS_NONSECCHAN_CHANNEL2_Msk         (_U_(0x1) << EVSYS_NONSECCHAN_CHANNEL2_Pos)          /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 2 Mask */
#define EVSYS_NONSECCHAN_CHANNEL2(value)      (EVSYS_NONSECCHAN_CHANNEL2_Msk & ((value) << EVSYS_NONSECCHAN_CHANNEL2_Pos))
#define EVSYS_NONSECCHAN_CHANNEL3_Pos         _U_(3)                                               /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 3 Position */
#define EVSYS_NONSECCHAN_CHANNEL3_Msk         (_U_(0x1) << EVSYS_NONSECCHAN_CHANNEL3_Pos)          /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 3 Mask */
#define EVSYS_NONSECCHAN_CHANNEL3(value)      (EVSYS_NONSECCHAN_CHANNEL3_Msk & ((value) << EVSYS_NONSECCHAN_CHANNEL3_Pos))
#define EVSYS_NONSECCHAN_CHANNEL4_Pos         _U_(4)                                               /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 4 Position */
#define EVSYS_NONSECCHAN_CHANNEL4_Msk         (_U_(0x1) << EVSYS_NONSECCHAN_CHANNEL4_Pos)          /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 4 Mask */
#define EVSYS_NONSECCHAN_CHANNEL4(value)      (EVSYS_NONSECCHAN_CHANNEL4_Msk & ((value) << EVSYS_NONSECCHAN_CHANNEL4_Pos))
#define EVSYS_NONSECCHAN_CHANNEL5_Pos         _U_(5)                                               /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 5 Position */
#define EVSYS_NONSECCHAN_CHANNEL5_Msk         (_U_(0x1) << EVSYS_NONSECCHAN_CHANNEL5_Pos)          /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 5 Mask */
#define EVSYS_NONSECCHAN_CHANNEL5(value)      (EVSYS_NONSECCHAN_CHANNEL5_Msk & ((value) << EVSYS_NONSECCHAN_CHANNEL5_Pos))
#define EVSYS_NONSECCHAN_CHANNEL6_Pos         _U_(6)                                               /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 6 Position */
#define EVSYS_NONSECCHAN_CHANNEL6_Msk         (_U_(0x1) << EVSYS_NONSECCHAN_CHANNEL6_Pos)          /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 6 Mask */
#define EVSYS_NONSECCHAN_CHANNEL6(value)      (EVSYS_NONSECCHAN_CHANNEL6_Msk & ((value) << EVSYS_NONSECCHAN_CHANNEL6_Pos))
#define EVSYS_NONSECCHAN_CHANNEL7_Pos         _U_(7)                                               /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 7 Position */
#define EVSYS_NONSECCHAN_CHANNEL7_Msk         (_U_(0x1) << EVSYS_NONSECCHAN_CHANNEL7_Pos)          /**< (EVSYS_NONSECCHAN) Non-Secure for Channel 7 Mask */
#define EVSYS_NONSECCHAN_CHANNEL7(value)      (EVSYS_NONSECCHAN_CHANNEL7_Msk & ((value) << EVSYS_NONSECCHAN_CHANNEL7_Pos))
#define EVSYS_NONSECCHAN_Msk                  _U_(0x000000FF)                                      /**< (EVSYS_NONSECCHAN) Register Mask  */

