Microchip-MPLAB-Harmony/csp/apps/trustZone/eic/Secure/firmware/src/packs/ATSAML11E16A_DFP/component/evsys.h
#define EVSYS_NONSECCHAN_CHANNEL_Pos          _U_(0)                                               /**< (EVSYS_NONSECCHAN Position) Non-Secure for Channel 7 */
#define EVSYS_NONSECCHAN_CHANNEL_Msk          (_U_(0xFF) << EVSYS_NONSECCHAN_CHANNEL_Pos)          /**< (EVSYS_NONSECCHAN Mask) CHANNEL */
#define EVSYS_NONSECCHAN_CHANNEL(value)       (EVSYS_NONSECCHAN_CHANNEL_Msk & ((value) << EVSYS_NONSECCHAN_CHANNEL_Pos)) 

/* -------- EVSYS_NSCHKCHAN : (EVSYS Offset: 0x1DC) (R/W 32) Non-Secure Channels Check -------- */
#define EVSYS_NSCHKCHAN_RESETVALUE            _U_(0x00)                                            /**<  (EVSYS_NSCHKCHAN) Non-Secure Channels Check  Reset Value */

#define EVSYS_NSCHKCHAN_CHANNEL0_Pos          _U_(0)                                               /**< (EVSYS_NSCHKCHAN) Channel 0 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL0_Msk          (_U_(0x1) << EVSYS_NSCHKCHAN_CHANNEL0_Pos)           /**< (EVSYS_NSCHKCHAN) Channel 0 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL0(value)       (EVSYS_NSCHKCHAN_CHANNEL0_Msk & ((value) << EVSYS_NSCHKCHAN_CHANNEL0_Pos))
#define EVSYS_NSCHKCHAN_CHANNEL1_Pos          _U_(1)                                               /**< (EVSYS_NSCHKCHAN) Channel 1 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL1_Msk          (_U_(0x1) << EVSYS_NSCHKCHAN_CHANNEL1_Pos)           /**< (EVSYS_NSCHKCHAN) Channel 1 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL1(value)       (EVSYS_NSCHKCHAN_CHANNEL1_Msk & ((value) << EVSYS_NSCHKCHAN_CHANNEL1_Pos))
#define EVSYS_NSCHKCHAN_CHANNEL2_Pos          _U_(2)                                               /**< (EVSYS_NSCHKCHAN) Channel 2 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL2_Msk          (_U_(0x1) << EVSYS_NSCHKCHAN_CHANNEL2_Pos)           /**< (EVSYS_NSCHKCHAN) Channel 2 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL2(value)       (EVSYS_NSCHKCHAN_CHANNEL2_Msk & ((value) << EVSYS_NSCHKCHAN_CHANNEL2_Pos))
#define EVSYS_NSCHKCHAN_CHANNEL3_Pos          _U_(3)                                               /**< (EVSYS_NSCHKCHAN) Channel 3 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL3_Msk          (_U_(0x1) << EVSYS_NSCHKCHAN_CHANNEL3_Pos)           /**< (EVSYS_NSCHKCHAN) Channel 3 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL3(value)       (EVSYS_NSCHKCHAN_CHANNEL3_Msk & ((value) << EVSYS_NSCHKCHAN_CHANNEL3_Pos))
#define EVSYS_NSCHKCHAN_CHANNEL4_Pos          _U_(4)                                               /**< (EVSYS_NSCHKCHAN) Channel 4 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL4_Msk          (_U_(0x1) << EVSYS_NSCHKCHAN_CHANNEL4_Pos)           /**< (EVSYS_NSCHKCHAN) Channel 4 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL4(value)       (EVSYS_NSCHKCHAN_CHANNEL4_Msk & ((value) << EVSYS_NSCHKCHAN_CHANNEL4_Pos))
#define EVSYS_NSCHKCHAN_CHANNEL5_Pos          _U_(5)                                               /**< (EVSYS_NSCHKCHAN) Channel 5 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL5_Msk          (_U_(0x1) << EVSYS_NSCHKCHAN_CHANNEL5_Pos)           /**< (EVSYS_NSCHKCHAN) Channel 5 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL5(value)       (EVSYS_NSCHKCHAN_CHANNEL5_Msk & ((value) << EVSYS_NSCHKCHAN_CHANNEL5_Pos))
#define EVSYS_NSCHKCHAN_CHANNEL6_Pos          _U_(6)                                               /**< (EVSYS_NSCHKCHAN) Channel 6 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL6_Msk          (_U_(0x1) << EVSYS_NSCHKCHAN_CHANNEL6_Pos)           /**< (EVSYS_NSCHKCHAN) Channel 6 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL6(value)       (EVSYS_NSCHKCHAN_CHANNEL6_Msk & ((value) << EVSYS_NSCHKCHAN_CHANNEL6_Pos))
#define EVSYS_NSCHKCHAN_CHANNEL7_Pos          _U_(7)                                               /**< (EVSYS_NSCHKCHAN) Channel 7 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL7_Msk          (_U_(0x1) << EVSYS_NSCHKCHAN_CHANNEL7_Pos)           /**< (EVSYS_NSCHKCHAN) Channel 7 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL7(value)       (EVSYS_NSCHKCHAN_CHANNEL7_Msk & ((value) << EVSYS_NSCHKCHAN_CHANNEL7_Pos))
#define EVSYS_NSCHKCHAN_Msk                   _U_(0x000000FF)                                      /**< (EVSYS_NSCHKCHAN) Register Mask  */

#define EVSYS_NSCHKCHAN_CHANNEL_Pos           _U_(0)                                               /**< (EVSYS_NSCHKCHAN Position) Channel 7 to be checked as non-secured */
#define EVSYS_NSCHKCHAN_CHANNEL_Msk           (_U_(0xFF) << EVSYS_NSCHKCHAN_CHANNEL_Pos)           /**< (EVSYS_NSCHKCHAN Mask) CHANNEL */
#define EVSYS_NSCHKCHAN_CHANNEL(value)        (EVSYS_NSCHKCHAN_CHANNEL_Msk & ((value) << EVSYS_NSCHKCHAN_CHANNEL_Pos)) 

/* -------- EVSYS_NONSECUSER : (EVSYS Offset: 0x1E0) (R/W 32) Users Security Attribution -------- */
#define EVSYS_NONSECUSER_RESETVALUE           _U_(0x00)                                            /**<  (EVSYS_NONSECUSER) Users Security Attribution  Reset Value */

#define EVSYS_NONSECUSER_USER0_Pos            _U_(0)                                               /**< (EVSYS_NONSECUSER) Non-Secure for User 0 Position */
#define EVSYS_NONSECUSER_USER0_Msk            (_U_(0x1) << EVSYS_NONSECUSER_USER0_Pos)             /**< (EVSYS_NONSECUSER) Non-Secure for User 0 Mask */
#define EVSYS_NONSECUSER_USER0(value)         (EVSYS_NONSECUSER_USER0_Msk & ((value) << EVSYS_NONSECUSER_USER0_Pos))
#define EVSYS_NONSECUSER_USER1_Pos            _U_(1)                                               /**< (EVSYS_NONSECUSER) Non-Secure for User 1 Position */
#define EVSYS_NONSECUSER_USER1_Msk            (_U_(0x1) << EVSYS_NONSECUSER_USER1_Pos)             /**< (EVSYS_NONSECUSER) Non-Secure for User 1 Mask */
#define EVSYS_NONSECUSER_USER1(value)         (EVSYS_NONSECUSER_USER1_Msk & ((value) << EVSYS_NONSECUSER_USER1_Pos))
#define EVSYS_NONSECUSER_USER2_Pos            _U_(2)                                               /**< (EVSYS_NONSECUSER) Non-Secure for User 2 Position */
#define EVSYS_NONSECUSER_USER2_Msk            (_U_(0x1) << EVSYS_NONSECUSER_USER2_Pos)             /**< (EVSYS_NONSECUSER) Non-Secure for User 2 Mask */
#define EVSYS_NONSECUSER_USER2(value)         (EVSYS_NONSECUSER_USER2_Msk & ((value) << EVSYS_NONSECUSER_USER2_Pos))
#define EVSYS_NONSECUSER_USER3_Pos            _U_(3)                                               /**< (EVSYS_NONSECUSER) Non-Secure for User 3 Position */
#define EVSYS_NONSECUSER_USER3_Msk            (_U_(0x1) << EVSYS_NONSECUSER_USER3_Pos)             /**< (EVSYS_NONSECUSER) Non-Secure for User 3 Mask */
#define EVSYS_NONSECUSER_USER3(value)         (EVSYS_NONSECUSER_USER3_Msk & ((value) << EVSYS_NONSECUSER_USER3_Pos))
#define EVSYS_NONSECUSER_USER4_Pos            _U_(4)                                               /**< (EVSYS_NONSECUSER) Non-Secure for User 4 Position */
#define EVSYS_NONSECUSER_USER4_Msk            (_U_(0x1) << EVSYS_NONSECUSER_USER4_Pos)             /**< (EVSYS_NONSECUSER) Non-Secure for User 4 Mask */
#define EVSYS_NONSECUSER_USER4(value)         (EVSYS_NONSECUSER_USER4_Msk & ((value) << EVSYS_NONSECUSER_USER4_Pos))
#define EVSYS_NONSECUSER_USER5_Pos            _U_(5)                                               /**< (EVSYS_NONSECUSER) Non-Secure for User 5 Position */
#define EVSYS_NONSECUSER_USER5_Msk            (_U_(0x1) << EVSYS_NONSECUSER_USER5_Pos)             /**< (EVSYS_NONSECUSER) Non-Secure for User 5 Mask */
#define EVSYS_NONSECUSER_USER5(value)         (EVSYS_NONSECUSER_USER5_Msk & ((value) << EVSYS_NONSECUSER_USER5_Pos))
#define EVSYS_NONSECUSER_USER6_Pos            _U_(6)                                               /**< (EVSYS_NONSECUSER) Non-Secure for User 6 Position */
#define EVSYS_NONSECUSER_USER6_Msk            (_U_(0x1) << EVSYS_NONSECUSER_USER6_Pos)             /**< (EVSYS_NONSECUSER) Non-Secure for User 6 Mask */
#define EVSYS_NONSECUSER_USER6(value)         (EVSYS_NONSECUSER_USER6_Msk & ((value) << EVSYS_NONSECUSER_USER6_Pos))
#define EVSYS_NONSECUSER_USER7_Pos            _U_(7)                                               /**< (EVSYS_NONSECUSER) Non-Secure for User 7 Position */
#define EVSYS_NONSECUSER_USER7_Msk            (_U_(0x1) << EVSYS_NONSECUSER_USER7_Pos)             /**< (EVSYS_NONSECUSER) Non-Secure for User 7 Mask */
#define EVSYS_NONSECUSER_USER7(value)         (EVSYS_NONSECUSER_USER7_Msk & ((value) << EVSYS_NONSECUSER_USER7_Pos))
#define EVSYS_NONSECUSER_USER8_Pos            _U_(8)                                               /**< (EVSYS_NONSECUSER) Non-Secure for User 8 Position */
#define EVSYS_NONSECUSER_USER8_Msk            (_U_(0x1) << EVSYS_NONSECUSER_USER8_Pos)             /**< (EVSYS_NONSECUSER) Non-Secure for User 8 Mask */
#define EVSYS_NONSECUSER_USER8(value)         (EVSYS_NONSECUSER_USER8_Msk & ((value) << EVSYS_NONSECUSER_USER8_Pos))
#define EVSYS_NONSECUSER_USER9_Pos            _U_(9)                                               /**< (EVSYS_NONSECUSER) Non-Secure for User 9 Position */
#define EVSYS_NONSECUSER_USER9_Msk            (_U_(0x1) << EVSYS_NONSECUSER_USER9_Pos)             /**< (EVSYS_NONSECUSER) Non-Secure for User 9 Mask */
#define EVSYS_NONSECUSER_USER9(value)         (EVSYS_NONSECUSER_USER9_Msk & ((value) << EVSYS_NONSECUSER_USER9_Pos))
#define EVSYS_NONSECUSER_USER10_Pos           _U_(10)                                              /**< (EVSYS_NONSECUSER) Non-Secure for User 10 Position */
#define EVSYS_NONSECUSER_USER10_Msk           (_U_(0x1) << EVSYS_NONSECUSER_USER10_Pos)            /**< (EVSYS_NONSECUSER) Non-Secure for User 10 Mask */
#define EVSYS_NONSECUSER_USER10(value)        (EVSYS_NONSECUSER_USER10_Msk & ((value) << EVSYS_NONSECUSER_USER10_Pos))
#define EVSYS_NONSECUSER_USER11_Pos           _U_(11)                                              /**< (EVSYS_NONSECUSER) Non-Secure for User 11 Position */
#define EVSYS_NONSECUSER_USER11_Msk           (_U_(0x1) << EVSYS_NONSECUSER_USER11_Pos)            /**< (EVSYS_NONSECUSER) Non-Secure for User 11 Mask */
#define EVSYS_NONSECUSER_USER11(value)        (EVSYS_NONSECUSER_USER11_Msk & ((value) << EVSYS_NONSECUSER_USER11_Pos))
#define EVSYS_NONSECUSER_USER12_Pos           _U_(12)                                              /**< (EVSYS_NONSECUSER) Non-Secure for User 12 Position */
#define EVSYS_NONSECUSER_USER12_Msk           (_U_(0x1) << EVSYS_NONSECUSER_USER12_Pos)            /**< (EVSYS_NONSECUSER) Non-Secure for User 12 Mask */
#define EVSYS_NONSECUSER_USER12(value)        (EVSYS_NONSECUSER_USER12_Msk & ((value) << EVSYS_NONSECUSER_USER12_Pos))
#define EVSYS_NONSECUSER_USER13_Pos           _U_(13)                                              /**< (EVSYS_NONSECUSER) Non-Secure for User 13 Position */
#define EVSYS_NONSECUSER_USER13_Msk           (_U_(0x1) << EVSYS_NONSECUSER_USER13_Pos)            /**< (EVSYS_NONSECUSER) Non-Secure for User 13 Mask */
#define EVSYS_NONSECUSER_USER13(value)        (EVSYS_NONSECUSER_USER13_Msk & ((value) << EVSYS_NONSECUSER_USER13_Pos))
#define EVSYS_NONSECUSER_USER14_Pos           _U_(14)                                              /**< (EVSYS_NONSECUSER) Non-Secure for User 14 Position */
#define EVSYS_NONSECUSER_USER14_Msk           (_U_(0x1) << EVSYS_NONSECUSER_USER14_Pos)            /**< (EVSYS_NONSECUSER) Non-Secure for User 14 Mask */
#define EVSYS_NONSECUSER_USER14(value)        (EVSYS_NONSECUSER_USER14_Msk & ((value) << EVSYS_NONSECUSER_USER14_Pos))
#define EVSYS_NONSECUSER_USER15_Pos           _U_(15)                                              /**< (EVSYS_NONSECUSER) Non-Secure for User 15 Position */
#define EVSYS_NONSECUSER_USER15_Msk           (_U_(0x1) << EVSYS_NONSECUSER_USER15_Pos)            /**< (EVSYS_NONSECUSER) Non-Secure for User 15 Mask */
#define EVSYS_NONSECUSER_USER15(value)        (EVSYS_NONSECUSER_USER15_Msk & ((value) << EVSYS_NONSECUSER_USER15_Pos))
#define EVSYS_NONSECUSER_USER16_Pos           _U_(16)                                              /**< (EVSYS_NONSECUSER) Non-Secure for User 16 Position */
#define EVSYS_NONSECUSER_USER16_Msk           (_U_(0x1) << EVSYS_NONSECUSER_USER16_Pos)            /**< (EVSYS_NONSECUSER) Non-Secure for User 16 Mask */
#define EVSYS_NONSECUSER_USER16(value)        (EVSYS_NONSECUSER_USER16_Msk & ((value) << EVSYS_NONSECUSER_USER16_Pos))
#define EVSYS_NONSECUSER_USER17_Pos           _U_(17)                                              /**< (EVSYS_NONSECUSER) Non-Secure for User 17 Position */
#define EVSYS_NONSECUSER_USER17_Msk           (_U_(0x1) << EVSYS_NONSECUSER_USER17_Pos)            /**< (EVSYS_NONSECUSER) Non-Secure for User 17 Mask */
#define EVSYS_NONSECUSER_USER17(value)        (EVSYS_NONSECUSER_USER17_Msk & ((value) << EVSYS_NONSECUSER_USER17_Pos))
#define EVSYS_NONSECUSER_USER18_Pos           _U_(18)                                              /**< (EVSYS_NONSECUSER) Non-Secure for User 18 Position */
#define EVSYS_NONSECUSER_USER18_Msk           (_U_(0x1) << EVSYS_NONSECUSER_USER18_Pos)            /**< (EVSYS_NONSECUSER) Non-Secure for User 18 Mask */
#define EVSYS_NONSECUSER_USER18(value)        (EVSYS_NONSECUSER_USER18_Msk & ((value) << EVSYS_NONSECUSER_USER18_Pos))
#define EVSYS_NONSECUSER_USER19_Pos           _U_(19)                                              /**< (EVSYS_NONSECUSER) Non-Secure for User 19 Position */
#define EVSYS_NONSECUSER_USER19_Msk           (_U_(0x1) << EVSYS_NONSECUSER_USER19_Pos)            /**< (EVSYS_NONSECUSER) Non-Secure for User 19 Mask */
#define EVSYS_NONSECUSER_USER19(value)        (EVSYS_NONSECUSER_USER19_Msk & ((value) << EVSYS_NONSECUSER_USER19_Pos))
#define EVSYS_NONSECUSER_USER20_Pos           _U_(20)                                              /**< (EVSYS_NONSECUSER) Non-Secure for User 20 Position */
#define EVSYS_NONSECUSER_USER20_Msk           (_U_(0x1) << EVSYS_NONSECUSER_USER20_Pos)            /**< (EVSYS_NONSECUSER) Non-Secure for User 20 Mask */
#define EVSYS_NONSECUSER_USER20(value)        (EVSYS_NONSECUSER_USER20_Msk & ((value) << EVSYS_NONSECUSER_USER20_Pos))
#define EVSYS_NONSECUSER_USER21_Pos           _U_(21)                                              /**< (EVSYS_NONSECUSER) Non-Secure for User 21 Position */
#define EVSYS_NONSECUSER_USER21_Msk           (_U_(0x1) << EVSYS_NONSECUSER_USER21_Pos)            /**< (EVSYS_NONSECUSER) Non-Secure for User 21 Mask */
#define EVSYS_NONSECUSER_USER21(value)        (EVSYS_NONSECUSER_USER21_Msk & ((value) << EVSYS_NONSECUSER_USER21_Pos))
#define EVSYS_NONSECUSER_USER22_Pos           _U_(22)                                              /**< (EVSYS_NONSECUSER) Non-Secure for User 22 Position */
#define EVSYS_NONSECUSER_USER22_Msk           (_U_(0x1) << EVSYS_NONSECUSER_USER22_Pos)            /**< (EVSYS_NONSECUSER) Non-Secure for User 22 Mask */
#define EVSYS_NONSECUSER_USER22(value)        (EVSYS_NONSECUSER_USER22_Msk & ((value) << EVSYS_NONSECUSER_USER22_Pos))
#define EVSYS_NONSECUSER_Msk                  _U_(0x007FFFFF)                                      /**< (EVSYS_NONSECUSER) Register Mask  */

#define EVSYS_NONSECUSER_USER_Pos             _U_(0)                                               /**< (EVSYS_NONSECUSER Position) Non-Secure for User 22 */
#define EVSYS_NONSECUSER_USER_Msk             (_U_(0x7FFFFF) << EVSYS_NONSECUSER_USER_Pos)         /**< (EVSYS_NONSECUSER Mask) USER */
#define EVSYS_NONSECUSER_USER(value)          (EVSYS_NONSECUSER_USER_Msk & ((value) << EVSYS_NONSECUSER_USER_Pos)) 

/* -------- EVSYS_NSCHKUSER : (EVSYS Offset: 0x1F0) (R/W 32) Non-Secure Users Check -------- */
#define EVSYS_NSCHKUSER_RESETVALUE            _U_(0x00)                                            /**<  (EVSYS_NSCHKUSER) Non-Secure Users Check  Reset Value */

