Microchip-MPLAB-Harmony/csp/apps/trustZone/eic/Secure/firmware/src/packs/ATSAML11E16A_DFP/component/evsys.h
#define EVSYS_NSCHKUSER_USER0_Pos             _U_(0)                                               /**< (EVSYS_NSCHKUSER) User 0 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER0_Msk             (_U_(0x1) << EVSYS_NSCHKUSER_USER0_Pos)              /**< (EVSYS_NSCHKUSER) User 0 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER0(value)          (EVSYS_NSCHKUSER_USER0_Msk & ((value) << EVSYS_NSCHKUSER_USER0_Pos))
#define EVSYS_NSCHKUSER_USER1_Pos             _U_(1)                                               /**< (EVSYS_NSCHKUSER) User 1 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER1_Msk             (_U_(0x1) << EVSYS_NSCHKUSER_USER1_Pos)              /**< (EVSYS_NSCHKUSER) User 1 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER1(value)          (EVSYS_NSCHKUSER_USER1_Msk & ((value) << EVSYS_NSCHKUSER_USER1_Pos))
#define EVSYS_NSCHKUSER_USER2_Pos             _U_(2)                                               /**< (EVSYS_NSCHKUSER) User 2 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER2_Msk             (_U_(0x1) << EVSYS_NSCHKUSER_USER2_Pos)              /**< (EVSYS_NSCHKUSER) User 2 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER2(value)          (EVSYS_NSCHKUSER_USER2_Msk & ((value) << EVSYS_NSCHKUSER_USER2_Pos))
#define EVSYS_NSCHKUSER_USER3_Pos             _U_(3)                                               /**< (EVSYS_NSCHKUSER) User 3 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER3_Msk             (_U_(0x1) << EVSYS_NSCHKUSER_USER3_Pos)              /**< (EVSYS_NSCHKUSER) User 3 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER3(value)          (EVSYS_NSCHKUSER_USER3_Msk & ((value) << EVSYS_NSCHKUSER_USER3_Pos))
#define EVSYS_NSCHKUSER_USER4_Pos             _U_(4)                                               /**< (EVSYS_NSCHKUSER) User 4 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER4_Msk             (_U_(0x1) << EVSYS_NSCHKUSER_USER4_Pos)              /**< (EVSYS_NSCHKUSER) User 4 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER4(value)          (EVSYS_NSCHKUSER_USER4_Msk & ((value) << EVSYS_NSCHKUSER_USER4_Pos))
#define EVSYS_NSCHKUSER_USER5_Pos             _U_(5)                                               /**< (EVSYS_NSCHKUSER) User 5 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER5_Msk             (_U_(0x1) << EVSYS_NSCHKUSER_USER5_Pos)              /**< (EVSYS_NSCHKUSER) User 5 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER5(value)          (EVSYS_NSCHKUSER_USER5_Msk & ((value) << EVSYS_NSCHKUSER_USER5_Pos))
#define EVSYS_NSCHKUSER_USER6_Pos             _U_(6)                                               /**< (EVSYS_NSCHKUSER) User 6 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER6_Msk             (_U_(0x1) << EVSYS_NSCHKUSER_USER6_Pos)              /**< (EVSYS_NSCHKUSER) User 6 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER6(value)          (EVSYS_NSCHKUSER_USER6_Msk & ((value) << EVSYS_NSCHKUSER_USER6_Pos))
#define EVSYS_NSCHKUSER_USER7_Pos             _U_(7)                                               /**< (EVSYS_NSCHKUSER) User 7 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER7_Msk             (_U_(0x1) << EVSYS_NSCHKUSER_USER7_Pos)              /**< (EVSYS_NSCHKUSER) User 7 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER7(value)          (EVSYS_NSCHKUSER_USER7_Msk & ((value) << EVSYS_NSCHKUSER_USER7_Pos))
#define EVSYS_NSCHKUSER_USER8_Pos             _U_(8)                                               /**< (EVSYS_NSCHKUSER) User 8 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER8_Msk             (_U_(0x1) << EVSYS_NSCHKUSER_USER8_Pos)              /**< (EVSYS_NSCHKUSER) User 8 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER8(value)          (EVSYS_NSCHKUSER_USER8_Msk & ((value) << EVSYS_NSCHKUSER_USER8_Pos))
#define EVSYS_NSCHKUSER_USER9_Pos             _U_(9)                                               /**< (EVSYS_NSCHKUSER) User 9 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER9_Msk             (_U_(0x1) << EVSYS_NSCHKUSER_USER9_Pos)              /**< (EVSYS_NSCHKUSER) User 9 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER9(value)          (EVSYS_NSCHKUSER_USER9_Msk & ((value) << EVSYS_NSCHKUSER_USER9_Pos))
#define EVSYS_NSCHKUSER_USER10_Pos            _U_(10)                                              /**< (EVSYS_NSCHKUSER) User 10 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER10_Msk            (_U_(0x1) << EVSYS_NSCHKUSER_USER10_Pos)             /**< (EVSYS_NSCHKUSER) User 10 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER10(value)         (EVSYS_NSCHKUSER_USER10_Msk & ((value) << EVSYS_NSCHKUSER_USER10_Pos))
#define EVSYS_NSCHKUSER_USER11_Pos            _U_(11)                                              /**< (EVSYS_NSCHKUSER) User 11 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER11_Msk            (_U_(0x1) << EVSYS_NSCHKUSER_USER11_Pos)             /**< (EVSYS_NSCHKUSER) User 11 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER11(value)         (EVSYS_NSCHKUSER_USER11_Msk & ((value) << EVSYS_NSCHKUSER_USER11_Pos))
#define EVSYS_NSCHKUSER_USER12_Pos            _U_(12)                                              /**< (EVSYS_NSCHKUSER) User 12 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER12_Msk            (_U_(0x1) << EVSYS_NSCHKUSER_USER12_Pos)             /**< (EVSYS_NSCHKUSER) User 12 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER12(value)         (EVSYS_NSCHKUSER_USER12_Msk & ((value) << EVSYS_NSCHKUSER_USER12_Pos))
#define EVSYS_NSCHKUSER_USER13_Pos            _U_(13)                                              /**< (EVSYS_NSCHKUSER) User 13 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER13_Msk            (_U_(0x1) << EVSYS_NSCHKUSER_USER13_Pos)             /**< (EVSYS_NSCHKUSER) User 13 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER13(value)         (EVSYS_NSCHKUSER_USER13_Msk & ((value) << EVSYS_NSCHKUSER_USER13_Pos))
#define EVSYS_NSCHKUSER_USER14_Pos            _U_(14)                                              /**< (EVSYS_NSCHKUSER) User 14 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER14_Msk            (_U_(0x1) << EVSYS_NSCHKUSER_USER14_Pos)             /**< (EVSYS_NSCHKUSER) User 14 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER14(value)         (EVSYS_NSCHKUSER_USER14_Msk & ((value) << EVSYS_NSCHKUSER_USER14_Pos))
#define EVSYS_NSCHKUSER_USER15_Pos            _U_(15)                                              /**< (EVSYS_NSCHKUSER) User 15 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER15_Msk            (_U_(0x1) << EVSYS_NSCHKUSER_USER15_Pos)             /**< (EVSYS_NSCHKUSER) User 15 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER15(value)         (EVSYS_NSCHKUSER_USER15_Msk & ((value) << EVSYS_NSCHKUSER_USER15_Pos))
#define EVSYS_NSCHKUSER_USER16_Pos            _U_(16)                                              /**< (EVSYS_NSCHKUSER) User 16 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER16_Msk            (_U_(0x1) << EVSYS_NSCHKUSER_USER16_Pos)             /**< (EVSYS_NSCHKUSER) User 16 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER16(value)         (EVSYS_NSCHKUSER_USER16_Msk & ((value) << EVSYS_NSCHKUSER_USER16_Pos))
#define EVSYS_NSCHKUSER_USER17_Pos            _U_(17)                                              /**< (EVSYS_NSCHKUSER) User 17 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER17_Msk            (_U_(0x1) << EVSYS_NSCHKUSER_USER17_Pos)             /**< (EVSYS_NSCHKUSER) User 17 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER17(value)         (EVSYS_NSCHKUSER_USER17_Msk & ((value) << EVSYS_NSCHKUSER_USER17_Pos))
#define EVSYS_NSCHKUSER_USER18_Pos            _U_(18)                                              /**< (EVSYS_NSCHKUSER) User 18 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER18_Msk            (_U_(0x1) << EVSYS_NSCHKUSER_USER18_Pos)             /**< (EVSYS_NSCHKUSER) User 18 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER18(value)         (EVSYS_NSCHKUSER_USER18_Msk & ((value) << EVSYS_NSCHKUSER_USER18_Pos))
#define EVSYS_NSCHKUSER_USER19_Pos            _U_(19)                                              /**< (EVSYS_NSCHKUSER) User 19 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER19_Msk            (_U_(0x1) << EVSYS_NSCHKUSER_USER19_Pos)             /**< (EVSYS_NSCHKUSER) User 19 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER19(value)         (EVSYS_NSCHKUSER_USER19_Msk & ((value) << EVSYS_NSCHKUSER_USER19_Pos))
#define EVSYS_NSCHKUSER_USER20_Pos            _U_(20)                                              /**< (EVSYS_NSCHKUSER) User 20 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER20_Msk            (_U_(0x1) << EVSYS_NSCHKUSER_USER20_Pos)             /**< (EVSYS_NSCHKUSER) User 20 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER20(value)         (EVSYS_NSCHKUSER_USER20_Msk & ((value) << EVSYS_NSCHKUSER_USER20_Pos))
#define EVSYS_NSCHKUSER_USER21_Pos            _U_(21)                                              /**< (EVSYS_NSCHKUSER) User 21 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER21_Msk            (_U_(0x1) << EVSYS_NSCHKUSER_USER21_Pos)             /**< (EVSYS_NSCHKUSER) User 21 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER21(value)         (EVSYS_NSCHKUSER_USER21_Msk & ((value) << EVSYS_NSCHKUSER_USER21_Pos))
#define EVSYS_NSCHKUSER_USER22_Pos            _U_(22)                                              /**< (EVSYS_NSCHKUSER) User 22 to be checked as non-secured Position */
#define EVSYS_NSCHKUSER_USER22_Msk            (_U_(0x1) << EVSYS_NSCHKUSER_USER22_Pos)             /**< (EVSYS_NSCHKUSER) User 22 to be checked as non-secured Mask */
#define EVSYS_NSCHKUSER_USER22(value)         (EVSYS_NSCHKUSER_USER22_Msk & ((value) << EVSYS_NSCHKUSER_USER22_Pos))
#define EVSYS_NSCHKUSER_Msk                   _U_(0x007FFFFF)                                      /**< (EVSYS_NSCHKUSER) Register Mask  */

#define EVSYS_NSCHKUSER_USER_Pos              _U_(0)                                               /**< (EVSYS_NSCHKUSER Position) User 22 to be checked as non-secured */
#define EVSYS_NSCHKUSER_USER_Msk              (_U_(0x7FFFFF) << EVSYS_NSCHKUSER_USER_Pos)          /**< (EVSYS_NSCHKUSER Mask) USER */
#define EVSYS_NSCHKUSER_USER(value)           (EVSYS_NSCHKUSER_USER_Msk & ((value) << EVSYS_NSCHKUSER_USER_Pos)) 

